{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true,
            "batch_input_shape": [null, 512],
            "dtype": "float32"
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": { "class_name": "Zeros", "config": {} },
            "gamma_initializer": { "class_name": "Ones", "config": {} },
            "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": { "class_name": "Zeros", "config": {} },
            "gamma_initializer": { "class_name": "Ones", "config": {} },
            "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": { "class_name": "Zeros", "config": {} },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 3.18.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [512, 32],
          "dtype": "float32"
        },
        { "name": "dense_Dense1/bias", "shape": [32], "dtype": "float32" },
        {
          "name": "batch_normalization_BatchNormalization1/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [32, 32],
          "dtype": "float32"
        },
        { "name": "dense_Dense2/bias", "shape": [32], "dtype": "float32" },
        {
          "name": "batch_normalization_BatchNormalization2/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/beta",
          "shape": [32],
          "dtype": "float32"
        },
        { "name": "dense_Dense3/kernel", "shape": [32, 1], "dtype": "float32" },
        { "name": "dense_Dense3/bias", "shape": [1], "dtype": "float32" },
        {
          "name": "batch_normalization_BatchNormalization1/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_variance",
          "shape": [32],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.18.0",
  "convertedBy": null
}
